app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Lethal Weapon 2"], ["rating", "R"], ["release_date", "1989-07-06 00:00:00.000000"], ["created_at", "2015-10-26 02:03:21.796640"], ["updated_at", "2015-10-26 02:03:21.796640"]]
---
  def add_tmdb

    selected_movies = params[:tmdb_movies]

    if selected_movies == nil
      flash[:notice] = "No movies selected"
      redirect_to movies_path
    else
      selected_movies.keys.each do |movie|
        Movie.create_from_tmdb(movie)